# Pandas Inbuilt Methods

In [1]:
import numpy as np
import pandas as pd

1) #pd.Series works like a column in a table.

In [4]:
Col1=(3,6,9,12,15)
mycol=pd.Series(Col1)
print(mycol)

0     3
1     6
2     9
3    12
4    15
dtype: int64

In [10]:
Col1=(3,6,9,12,15)
mycol=pd.Series(Col1, index=["A","B","C","D","E"])
print(mycol)

A     3
B     6
C     9
D    12
E    15
dtype: int64

In [8]:
print(mycol["D"])

12

2) #pd.DataFrame works as a table with rows and columns.

In [23]:
Age={
    "Pre-teen":[5,6,7,8,9,10],
"Teenager":[11,12,13,14,15,16],
"Adult":[18,19,20,21,22,23]}
df=pd.DataFrame(Age, index=["A","B","C","D","E","F"])
print(df)

   Pre-teen  Teenager  Adult
A         5        11     18
B         6        12     19
C         7        13     20
D         8        14     21
E         9        15     22
F        10        16     23

3) #df.loc returns rows in a table.

In [24]:
print(df.loc["C"])

Pre-teen     7
Teenager    13
Adult       20
Name: C, dtype: int64

4) #df.head returns the first rows in a table.

In [25]:
df.head(3)

   Pre-teen  Teenager  Adult
A         5        11     18
B         6        12     19
C         7        13     20

5) #df.tail returns the last rows in a table.

In [26]:
df.tail(3)

   Pre-teen  Teenager  Adult
D         8        14     21
E         9        15     22
F        10        16     23

6) #df.shape returns toal number of rows and columns in a table.

In [29]:
df.shape

(6, 3)

7) #df.size returns the number of rows times number of colums in a data frame.

In [28]:
df.size

18

8) #df.info gives information about a data frame.

In [30]:
df.info

<bound method DataFrame.info of    Pre-teen  Teenager  Adult
A         5        11     18
B         6        12     19
C         7        13     20
D         8        14     21
E         9        15     22
F        10        16     23>

9) #df.isna() gives information about a data frame.

In [31]:
df.isna

<bound method DataFrame.isna of    Pre-teen  Teenager  Adult
A         5        11     18
B         6        12     19
C         7        13     20
D         8        14     21
E         9        15     22
F        10        16     23>

10) #df.isna().sum() returns the total null values

In [32]:
df.isna().sum()

Pre-teen    0
Teenager    0
Adult       0
dtype: int64

11) #df.describe gives the count, mean, minimun, maximum, standard deviation and summary.

In [34]:
df.describe()

        Pre-teen   Teenager      Adult
count   6.000000   6.000000   6.000000
mean    7.500000  13.500000  20.500000
std     1.870829   1.870829   1.870829
min     5.000000  11.000000  18.000000
25%     6.250000  12.250000  19.250000
50%     7.500000  13.500000  20.500000
75%     8.750000  14.750000  21.750000
max    10.000000  16.000000  23.000000

12) #df.nunique gives all the unique values a variable contains

In [36]:
df.nunique()

Pre-teen    6
Teenager    6
Adult       6
dtype: int64

13) #df.value_counts returns counts of unique values.

In [40]:
df.value_counts()

Pre-teen  Teenager  Adult
5         11        18       1
6         12        19       1
7         13        20       1
8         14        21       1
9         15        22       1
10        16        23       1
dtype: int64

14) #df.columns gives the names of all the columns in a data frame.

In [43]:
df.columns

Index(['Pre-teen', 'Teenager', 'Adult'], dtype='object')

15) #len(df) gives length of rows in a data frame.

In [48]:
len(df)

6

16) #df.iloc returns subset of a specified parameter(rows;index columns).

In [52]:
df.iloc[:5,1:3]

   Teenager  Adult
A        11     18
B        12     19
C        13     20
D        14     21
E        15     22

17) #df.select_dtypes() returns the variables of a specified data type.

In [54]:
df.select_dtypes(include="int64")

   Pre-teen  Teenager  Adult
A         5        11     18
B         6        12     19
C         7        13     20
D         8        14     21
E         9        15     22
F        10        16     23

18) #df.insert inserts a column in the specified position.

In [76]:
Infant=np.random.randint(6, size=len(df))
df.insert(1,"Infant", Infant)
df.head()

   Pre-teen  Infant  Toodler  Teenager  Adult
A         5       1        1        11     18
B         6       1        5        12     19
C         7       4        3        13     20
D         8       1        0        14     21
E         9       3        1        15     22

19) #df.isnull checks for missing values and returns true if missing and false for complete.

In [82]:
df.isnull()

   Pre-teen  Infant  Toodler  Teenager  Adult
A     False   False    False     False  False
B     False   False    False     False  False
C     False   False    False     False  False
D     False   False    False     False  False
E     False   False    False     False  False
F     False   False    False     False  False

20) #df.drop deletes a column in a data frame

In [83]:
df.head()

   Pre-teen  Infant  Toodler  Teenager  Adult
A         5       1        1        11     18
B         6       1        5        12     19
C         7       4        3        13     20
D         8       1        0        14     21
E         9       3        1        15     22

In [89]:
df1=df
df1.drop("Toodler", axis=1)

   Pre-teen  Infant  Teenager  Adult
A         5       1        11     18
B         6       1        12     19
C         7       4        13     20
D         8       1        14     21
E         9       3        15     22
F        10       0        16     23